app/views/users/show.html.erb

SELECT COUNT(*) FROM `tweets` WHERE `tweets`.`user_id` = 6
---

<p><%= pluralize(@user.tweets.size, "Tweet") %></p>