app/controllers/tweets_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = NULL LIMIT 1
---
  def new
    @user = User.find(params[:user_id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 8 LIMIT 1
---
  def create
    @user = User.find(params[:user_id])