app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `updated_at`) VALUES ('2017-08-29 18:02:17', '2017-08-29 18:02:17')
---
  def create
    @user = User.new(params[:User])
    @user.save